train_SM/generate_data_3d/original_snappy/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
603056
(
(0.205117 -0.00468874 0.0499499)
(0.204999 -0.00487357 0.0490634)
(0.205046 -0.00311537 0.0499235)
(0.206677 -0.00511781 0.0498795)
(0.206436 -0.00528911 0.0490062)
(0.204759 -0.00311014 0.0490644)
(0.205178 -0.00481603 0.0471755)
(0.204655 -0.00522909 0.0487433)
...
)
;

boundaryField
{
    geometry_z_top
    {
        type            calculated;
        value           nonuniform List<vector> 
13602
(
(0.0010419 -0.0489594 0.05)
(0.00698506 -0.0490624 0.05)
(0.0089948 -0.0490679 0.05)
(0.0149999 -0.0490723 0.05)
(0.0169999 -0.0490724 0.05)
(0.023 -0.0490723 0.05)
(0.025 -0.0490723 0.05)
(0.031 -0.0490723 0.05)
...
)
;
    }
    geometry_z_bot
    {
        type            calculated;
        value           nonuniform List<vector> 
13602
(
(0.013881 -0.03386 -0.05)
(0.0220132 -0.0337995 -0.05)
(0.0299977 -0.033803 -0.05)
(0.038 -0.0338032 -0.05)
(0.0460001 -0.0338031 -0.05)
(0.054 -0.0338031 -0.05)
(0.062 -0.0338031 -0.05)
(0.07 -0.0338031 -0.05)
...
)
;
    }
    geometry_y_bot
    {
        type            calculated;
        value           nonuniform List<vector> 
13650
(
(0.013881 -0.05 -0.03386)
(0.0220132 -0.05 -0.0337995)
(0.0299977 -0.05 -0.033803)
(0.038 -0.05 -0.0338031)
(0.0460001 -0.05 -0.0338031)
(0.054 -0.05 -0.0338031)
(0.062 -0.05 -0.0338031)
(0.07 -0.05 -0.0338031)
...
)
;
    }
    geometry_inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
1048
(
(0 -0.0469563 -0.0490113)
(0 -0.0450261 -0.0490519)
(0 -0.0410057 -0.0490685)
(0 -0.0430156 -0.0490646)
(0 -0.0390022 -0.0490693)
(0 -0.0370008 -0.0490695)
(0 -0.033 -0.0490696)
(0 -0.0350003 -0.0490696)
...
)
;
    }
    geometry_y_top
    {
        type            calculated;
        value           nonuniform List<vector> 
13650
(
(0.00104505 0.05 -0.0489572)
(0.000992286 0.05 -0.046958)
(0.00698534 0.05 -0.0490627)
(0.00899434 0.05 -0.0490667)
(0.0149998 0.05 -0.0490723)
(0.0169998 0.05 -0.0490724)
(0.0229988 0.05 -0.0490728)
(0.0249992 0.05 -0.0490711)
...
)
;
    }
    geometry_outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
1300
(
(0.75 -0.043073 -0.043073)
(0.75 -0.0350079 -0.0431864)
(0.75 -0.0270007 -0.0431911)
(0.75 -0.0190002 -0.0431906)
(0.75 -0.0110003 -0.0431905)
(0.75 -0.00300028 -0.0431905)
(0.75 0.00499972 -0.0431905)
(0.75 0.0129997 -0.0431905)
...
)
;
    }
    geometry_obstacle
    {
        type            calculated;
        value           nonuniform List<vector> 
2000
(
(0.204952 -0.018151 -0.0430062)
(0.204953 -0.0181508 -0.035)
(0.204952 -0.0181508 -0.027)
(0.204952 -0.0181508 -0.019)
(0.204953 -0.0181508 -0.011)
(0.204952 -0.0181508 -0.003)
(0.204952 -0.0181508 0.005)
(0.204953 -0.0181508 0.013)
...
)
;
    }
}


// ************************************************************************* //
