train_SM/generate_data_3d/original_snappy/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
603056
(
0.205117
0.204999
0.205046
0.206677
0.206436
0.204759
0.205178
0.204655
...
)
;

boundaryField
{
    geometry_z_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
13602
(
0.0010419
0.00698506
0.0089948
0.0149999
0.0169999
0.023
0.025
0.031
...
)
;
    }
    geometry_z_bot
    {
        type            calculated;
        value           nonuniform List<scalar> 
13602
(
0.013881
0.0220132
0.0299977
0.038
0.0460001
0.054
0.062
0.07
...
)
;
    }
    geometry_y_bot
    {
        type            calculated;
        value           nonuniform List<scalar> 
13650
(
0.013881
0.0220132
0.0299977
0.038
0.0460001
0.054
0.062
0.07
...
)
;
    }
    geometry_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    geometry_y_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
13650
(
0.00104505
0.000992286
0.00698534
0.00899434
0.0149998
0.0169998
0.0229988
0.0249992
...
)
;
    }
    geometry_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1300
(
0.75
0.75
0.75
0.75
0.75
0.75
0.75
0.75
...
)
;
    }
    geometry_obstacle
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
0.204952
0.204953
0.204952
0.204952
0.204953
0.204952
0.204952
0.204953
...
)
;
    }
}


// ************************************************************************* //
