train_SM/generate_data_3d/original_snappy/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
603056
(
-0.00468874
-0.00487357
-0.00311537
-0.00511781
-0.00528911
-0.00311014
-0.00481603
-0.00522909
...
)
;

boundaryField
{
    geometry_z_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
13602
(
-0.0489594
-0.0490624
-0.0490679
-0.0490723
-0.0490724
-0.0490723
-0.0490723
-0.0490723
...
)
;
    }
    geometry_z_bot
    {
        type            calculated;
        value           nonuniform List<scalar> 
13602
(
-0.03386
-0.0337995
-0.033803
-0.0338032
-0.0338031
-0.0338031
-0.0338031
-0.0338031
...
)
;
    }
    geometry_y_bot
    {
        type            calculated;
        value           nonuniform List<scalar> 
13650
(
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
...
)
;
    }
    geometry_inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1048
(
-0.0469563
-0.0450261
-0.0410057
-0.0430156
-0.0390022
-0.0370008
-0.033
-0.0350003
...
)
;
    }
    geometry_y_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
13650
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    geometry_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1300
(
-0.043073
-0.0350079
-0.0270007
-0.0190002
-0.0110003
-0.00300028
0.00499972
0.0129997
...
)
;
    }
    geometry_obstacle
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
-0.018151
-0.0181508
-0.0181508
-0.0181508
-0.0181508
-0.0181508
-0.0181508
-0.0181508
...
)
;
    }
}


// ************************************************************************* //
