train_SM/generate_data_3d/original_snappy/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
603056
(
0.0499499
0.0490634
0.0499235
0.0498795
0.0490062
0.0490644
0.0471755
0.0487433
...
)
;

boundaryField
{
    geometry_z_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
13602
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    geometry_z_bot
    {
        type            calculated;
        value           nonuniform List<scalar> 
13602
(
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
...
)
;
    }
    geometry_y_bot
    {
        type            calculated;
        value           nonuniform List<scalar> 
13650
(
-0.03386
-0.0337995
-0.033803
-0.0338031
-0.0338031
-0.0338031
-0.0338031
-0.0338031
...
)
;
    }
    geometry_inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1048
(
-0.0490113
-0.0490519
-0.0490685
-0.0490646
-0.0490693
-0.0490695
-0.0490696
-0.0490696
...
)
;
    }
    geometry_y_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
13650
(
-0.0489572
-0.046958
-0.0490627
-0.0490667
-0.0490723
-0.0490724
-0.0490728
-0.0490711
...
)
;
    }
    geometry_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1300
(
-0.043073
-0.0431864
-0.0431911
-0.0431906
-0.0431905
-0.0431905
-0.0431905
-0.0431905
...
)
;
    }
    geometry_obstacle
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
-0.0430062
-0.035
-0.027
-0.019
-0.011
-0.003
0.005
0.013
...
)
;
    }
}


// ************************************************************************* //
