train_SM/generate_data_3d/original_snappy/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288.15;

boundaryField
{
    geometry_z_top
    {
        type            zeroGradient;
    }
    geometry_z_bot
    {
        type            zeroGradient;
    }
    geometry_y_bot
    {
        type            zeroGradient;
    }
    geometry_inlet
    {
        type            fixedValue;
        value           uniform 288.15;
    }
    geometry_y_top
    {
        type            zeroGradient;
    }
    geometry_outlet
    {
        type            zeroGradient;
    }
    geometry_obstacle
    {
        type            fixedValue;
        value           uniform 473.15;
    }
}


// ************************************************************************* //
