train_SM/generate_data_3d/original_snappy/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    geometry_z_top
    {
        type            calculated;
        value           uniform 100000;
    }
    geometry_z_bot
    {
        type            calculated;
        value           uniform 100000;
    }
    geometry_y_bot
    {
        type            calculated;
        value           uniform 100000;
    }
    geometry_inlet
    {
        type            calculated;
        value           uniform 100000;
    }
    geometry_y_top
    {
        type            calculated;
        value           uniform 100000;
    }
    geometry_outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    geometry_obstacle
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
