train_SM/generate_data_3d/original_snappy/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    geometry_z_top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          13602;
        startFace       1785728;
    }
    geometry_z_bot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          13602;
        startFace       1799330;
    }
    geometry_y_bot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          13650;
        startFace       1812932;
    }
    geometry_inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1048;
        startFace       1826582;
    }
    geometry_y_top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          13650;
        startFace       1827630;
    }
    geometry_outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1300;
        startFace       1841280;
    }
    geometry_obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2000;
        startFace       1842580;
    }
)

// ************************************************************************* //
